{"idx": "fulltest_prompt_audio", "gt_lyric": "[intro-short] ; [verse] Shadows on the block. heavy steps and cold breath. Night air thick. money talks. no time for rest. Sirens fade. pressure stays. we move with the beat. Keep it low. hold the line. never feel defeat. ; [chorus] Ride slow. bass low. city glow in the rain. Heart of steel. street code. we survive the pain. From the curb to the skyline. we rise. no fear. Real ones stay. real ones move. we stay here. ; [inst-short] ; [verse] Backseat smoke. hands on the wheel. eyes ahead. Hustle hard. keep it tight. say what we said. Block by block. night by night. we keep control. ; [chorus] Ride slow. bass low. city glow in the rain. Heart of steel. street code. we survive the pain. From the curb to the skyline. we rise. no fear. Real ones stay. real ones move. we stay here. ; [outro-short]", "descriptions": "male, gritty, hip hop, trap drums, dark bass, intense flow.", "prompt_audio_path": "sample/realsongssamoples/Hellrazor - 2Pac.mp3"}
{"idx": "fulltest_prompt_stems", "gt_lyric": "[intro-short] ; [verse] Summer lights. late nights. we dance on the street. Radio up. windows down. follow the beat. Every laugh. every spark. feels so right. Hold my hand. spin around. lose the night. ; [chorus] We go up. we glow. like a city on fire. Hearts aligned. every step. take us higher. Hands in the air. let it show. this is our time. ; [inst-short] ; [verse] Sunrise drive. easy smiles. we feel brand new. Every road. every sign. points to you. ; [chorus] We go up. we glow. like a city on fire. Hearts aligned. every step. take us higher. Hands in the air. let it show. this is our time. ; [outro-short]", "descriptions": "female, bright pop, punchy drums, shimmering synths.", "prompt_vocal_path": "sample/realsongssamoples/stems/pop_en_vocal.wav", "prompt_bgm_path": "sample/realsongssamoples/stems/pop_en_bgm.wav"}
{"idx": "fulltest_auto_prompt", "gt_lyric": "[intro-short] ; [verse] Soft glow in the room. slow breath. quiet eyes. Midnight moves. velvet tone. under city skies. Hold me close. let it roll. easy and smooth. ; [chorus] Stay with me. move slow. let the night breathe. Heart to heart. we align. in a quiet dream. ; [inst-short] ; [verse] Moonlight fades. we remain. in the same place. ; [chorus] Stay with me. move slow. let the night breathe. Heart to heart. we align. in a quiet dream. ; [outro-short]", "descriptions": "male, moody, rnb, smooth bass, airy pads.", "auto_prompt_audio_type": "Auto"}
