{"idx": "gangsta_rap_en", "gt_lyric": "[intro-short] ; [verse] Uh. midnight concrete. streetlight glow. Low bass hum. let the sub shake slow. Count the blocks. count the scars. count the code. I move quiet. heavy steps. carry the load. No cap. no glam. just grit and grind. Cold eyes. tight crew. sharp mind. I talk in bars. short breath. quick fire. Hustle in my blood. wire to wire. ; [chorus] Yeah. we ride on the low. 808s on blast. Sirens in the air. let the kick hit fast. From the corner to the skyline. we survive. Heart of the city. we alive. we alive. ; [inst-short] ; [verse] Skrrt. lane switch. smoke trail. pressure rise. I never fold. I never fail. Truth on the tongue. pain in the rhyme. Beat like a hammer. heavy on time. Talk that talk. walk that walk. no retreat. Real ones move with a steady heartbeat. ; [chorus] Yeah. we ride on the low. 808s on blast. Sirens in the air. let the kick hit fast. From the corner to the skyline. we survive. Heart of the city. we alive. we alive. ; [outro-short]", "descriptions": "male, dark, hip hop, rap, angry, bass and drums, the bpm is 92.", "prompt_audio_path": "sample/sample_prompt_audio.wav"}
{"idx": "pop_en", "gt_lyric": "[intro-short] ; [verse] Sunrise in the glass. city turns gold. I feel the rush. let the story unfold. You and me. spark in the air. Bright lights call. we are already there. ; [chorus] We go up. we glow. like neon in the night. Hearts on fire. everything feels right. Hold my hand. dont let go. This is our moment. let it show. ; [inst-short] ; [verse] Late night streets. we spin and sway. Every beat says stay. stay. stay. ; [chorus] We go up. we glow. like neon in the night. Hearts on fire. everything feels right. Hold my hand. dont let go. This is our moment. let it show. ; [outro-short]", "descriptions": "female, bright, pop, happy, synthesizer and drums, the bpm is 120.", "auto_prompt_audio_type": "Pop"}
{"idx": "rock_en", "gt_lyric": "[intro-short] ; [verse] Dust on the highway. engine in time. I hit the throttle. chasing the line. Steel in my chest. sparks in my veins. Turn it up. break the chains. ; [chorus] We scream it loud. we never bend. Guitars like thunder. the night wont end. Raise your voice. shake the ground. This is the sound. this is the sound. ; [inst-short] ; [verse] Salt on my skin. rain on the hood. I live fast. I live good. ; [chorus] We scream it loud. we never bend. Guitars like thunder. the night wont end. Raise your voice. shake the ground. This is the sound. this is the sound. ; [outro-short]", "descriptions": "male, rock, intense, electric guitar and drums, the bpm is 110.", "auto_prompt_audio_type": "Rock"}
{"idx": "metal_en", "gt_lyric": "[intro-short] ; [verse] Iron in the air. fire in the throat. Shadows rise. hear the engines roar. I stand tall. unbroken code. This is war. this is war. ; [chorus] Crash. collide. let the metal ring. Fists in the air. hear the crowd sing. Fear is gone. we own the night. Flames in our eyes. endless fight. ; [inst-short] ; [verse] Blood and steel. we carve the storm. Heavy steps. we bring the thunder. ; [chorus] Crash. collide. let the metal ring. Fists in the air. hear the crowd sing. Fear is gone. we own the night. Flames in our eyes. endless fight. ; [outro-short]", "descriptions": "male, dark, metal, angry, electric guitar and drums, the bpm is 140.", "auto_prompt_audio_type": "Metal"}
{"idx": "reggae_en", "gt_lyric": "[intro-short] ; [verse] Ocean breeze. slow and sweet. Barefoot dancing. easy beat. Sunny days. we drift along. Smile in the sky. sing the song. ; [chorus] One love. one heart. we feel the sway. Gentle rhythm carries us away. Hold me close. keep it light. Island fire in the moonlight. ; [inst-short] ; [verse] Palm trees sway. time moves slow. Let the bassline roll. roll. roll. ; [chorus] One love. one heart. we feel the sway. Gentle rhythm carries us away. Hold me close. keep it light. Island fire in the moonlight. ; [outro-short]", "descriptions": "male, warm, reggae, uplifting, guitar and drums, the bpm is 80.", "auto_prompt_audio_type": "Reggae"}
