{"idx": "gangsta_rap_en", "gt_lyric": "[intro-short] ; [verse] Cold wind on the corner. I move with the crew. Eyes low, mind sharp, never break the rule. Loyalty first and my word stays sealed. Every step in the city got a price I feel. I hustle with patience and I breathe through the noise. Steel sky above me, but I keep my poise. ; [chorus] This is the code. This is the mode. We rise, we ride, we carry the load. No fake, no fold, we keep it composed. City on my back and I never let go. ; [inst-short] ; [verse] Street lights flicker like a heartbeat drum. I keep the rhythm even when the night gets numb. Family on my shoulder, I protect what I know. I speak in the gravel where the real ones go. No fear in my chest, just a calm heavy tone. I built my name from the stone to the throne. ; [chorus] This is the code. This is the mode. We rise, we ride, we carry the load. No fake, no fold, we keep it composed. City on my back and I never let go. ; [outro-short]", "descriptions": "male, gangsta rap, gritty, boom bap, heavy drums and bass, 92 bpm.", "auto_prompt_audio_type": "Auto"}
{"idx": "rnb_en", "gt_lyric": "[intro-short] ; [verse] Slow rain on the window. You pull me close. Your voice is a river, the warmest note. Midnight in the kitchen, we sway in time. Every breath a promise, every touch a rhyme. ; [chorus] Stay here, stay near, let the world fade out. I can feel your heartbeat when I hear you breathe out. Soft light, soft sky, let our worries fall. In this velvet moment, I give you all. ; [inst-short] ; [verse] Moonlight on the floorboards, satin and gold. Your hands on my shoulders keep me from the cold. We move like a whisper in a quiet room. Love is in the silence and the candle bloom. ; [chorus] Stay here, stay near, let the world fade out. I can feel your heartbeat when I hear you breathe out. Soft light, soft sky, let our worries fall. In this velvet moment, I give you all. ; [outro-short]", "descriptions": "female, smooth r&b, soulful, mellow, electric piano and bass.", "auto_prompt_audio_type": "R&B"}
{"idx": "rock_en", "gt_lyric": "[intro-short] ; [verse] We were born to the thunder of a broken road. Every scar is a story, every shout a code. I feel the drums in my ribs, the crowd in my veins. We burn like a signal through the heavy rain. ; [chorus] Turn it up, we are alive tonight. Hands up, we are chasing the light. No chains, no fear, we are here to fight. We run, we roar, we own the night. ; [inst-short] ; [verse] Gasoline dreams and a steel guitar. I throw my voice like a shooting star. If the world is a wall, we will tear it down. With a fire in our lungs and a crown of sound. ; [chorus] Turn it up, we are alive tonight. Hands up, we are chasing the light. No chains, no fear, we are here to fight. We run, we roar, we own the night. ; [outro-short]", "descriptions": "male, rock, energetic, electric guitar and drums.", "auto_prompt_audio_type": "Rock"}
{"idx": "dance_en", "gt_lyric": "[intro-short] ; [verse] Neon on the boulevard, we light the floor. Every step a spark, we are asking for more. Your laugh cuts the darkness, my pulse keeps time. We ride the rhythm like a perfect line. ; [chorus] Move with me, lose the gravity. Heartbeat high in a sea of melody. Hands up, we glow, we fly so free. Tonight is ours in the electric city. ; [inst-short] ; [verse] Sugar in the air and a bassline heat. We spin through the silence with the tapping feet. Hold on, hold close, let the beat decide. Every breath a fire and the night a ride. ; [chorus] Move with me, lose the gravity. Heartbeat high in a sea of melody. Hands up, we glow, we fly so free. Tonight is ours in the electric city. ; [outro-short]", "descriptions": "female, dance pop, bright, synths and four-on-the-floor, 124 bpm.", "auto_prompt_audio_type": "Dance"}
