{"idx": "gangsta_rap_en", "gt_lyric": "[intro-short] ; [verse] Midnight on the block. I keep the pace low and steady. Heavy bass in my chest. I stay calm and ready. Loyalty first, my circle stays tight. I move with the code through the heat of the night. I talk in the gravel, my tone stays cold. I write what I live, never break or fold. ; [chorus] This is the code. This is the mode. We ride, we rise, we carry the load. No fake, no fold, we keep it composed. City on my back and I never let go. ; [inst-short] ; [verse] Streetlight shimmer and a slow head nod. I count every step on the same hard road. Family on my shoulder, I guard what I know. Quiet in my stare but the message is bold. I keep the rhythm with the drums and bass. I turn every scar into power and grace. ; [chorus] This is the code. This is the mode. We ride, we rise, we carry the load. No fake, no fold, we keep it composed. City on my back and I never let go. ; [outro-short]", "descriptions": "male, dark, hip hop, intense, bass and drums, the bpm is 92.", "auto_prompt_audio_type": "Auto"}
{"idx": "pop_en", "gt_lyric": "[intro-short] ; [verse] City lights are breathing slow. I walk the avenue alone. Your name is rising with the dawn. I hear it in the humming phones. ; [chorus] Stay with me tonight. We are sparks across the sky. Hold my hand and make it right. We will run until we fly. ; [inst-short] ; [verse] Coffee cups and yellow rain. We laugh beneath the passing trains. Every step becomes a sign. Every heartbeat keeps the time. ; [chorus] Stay with me tonight. We are sparks across the sky. Hold my hand and make it right. We will run until we fly. ; [outro-short]", "descriptions": "female, bright, pop, happy, guitar and drums, the bpm is 120.", "auto_prompt_audio_type": "Pop"}
{"idx": "rnb_en", "gt_lyric": "[intro-short] ; [verse] Slow rain on the window. You pull me close. Your voice is a river, the warmest note. Midnight in the kitchen, we sway in time. Every breath a promise, every touch a rhyme. ; [chorus] Stay here, stay near, let the world fade out. I can feel your heartbeat when I hear you breathe out. Soft light, soft sky, let our worries fall. In this velvet moment, I give you all. ; [inst-short] ; [verse] Moonlight on the floorboards, satin and gold. Your hands on my shoulders keep me from the cold. We move like a whisper in a quiet room. Love is in the silence and the candle bloom. ; [chorus] Stay here, stay near, let the world fade out. I can feel your heartbeat when I hear you breathe out. Soft light, soft sky, let our worries fall. In this velvet moment, I give you all. ; [outro-short]", "descriptions": "female, warm, R&B, romantic, synthesizer and bass, the bpm is 88.", "auto_prompt_audio_type": "R&B"}
{"idx": "rock_en", "gt_lyric": "[intro-short] ; [verse] We were born to the thunder of a broken road. Every scar is a story, every shout a code. I feel the drums in my ribs, the crowd in my veins. We burn like a signal through the heavy rain. ; [chorus] Turn it up, we are alive tonight. Hands up, we are chasing the light. No chains, no fear, we are here to fight. We run, we roar, we own the night. ; [inst-short] ; [verse] Gasoline dreams and a steel guitar. I throw my voice like a shooting star. If the world is a wall, we will tear it down. With a fire in our lungs and a crown of sound. ; [chorus] Turn it up, we are alive tonight. Hands up, we are chasing the light. No chains, no fear, we are here to fight. We run, we roar, we own the night. ; [outro-short]", "descriptions": "male, rock, intense, electric guitar and drums, the bpm is 130.", "auto_prompt_audio_type": "Rock"}
